[{"title":"ASPLOS半日行","date":"2017-04-17T13:09:05.000Z","path":"2017/04/17/ASPLOS/","text":"ASPLOS半日行出乎意料，自己能以本科生的身份 体验到了计算机顶级会议ASPLOS 2017 作为一个还在刷CSAPP的小白，能够十分幸运的来到西安，和众多世界级的科学家坐在一起，感受聆听CS最前沿的革新。在此，首先要感谢的是为我们努力争取的@石老师，以及同行的ACM全体大佬们。 长安古风 一日看尽长安花 标志的大雁塔，东西两部的钟楼和鼓楼 厚重的西安城墙，依稀看到古都的影子 biangbiang面，羊肉泡馍，特色的西安小吃 西北粗犷的饮食风格，感受城市独到的魅力 Main Conference开场第一次接触这种顶级的会议，没有想象中的严肃刻板。反而感受到了一种轻松融洽的气氛。 阿里的首席科学家周靖人开场就讲解了阿里云的技术创新，不仅包括大数据和AI，还有各种交互式 流计算和图计算等等。关于数据质量检测和机器学习，也有所提及。虽然关于技术讲解并没有想象的难如天书，但是也足够窥见阿里背后的惊人的技术投入，把我对于阿里的认识从策划公司转变到了科技公司，感受到了企业对于世界计算机技术发展的强大推动力。 Lighting Session受制于现在的知识水平，如果说开始周靖人的演讲能够让我大体听懂，之后90秒一篇的paper对于我的确有些勉强。能够理解表达的中心含义实属不易，但是即便如此，还是能够感受到这些世界顶级的科研人员对于技术的热情。 像下面这位天生的演讲家。 也让我在初步接触到世界最前沿的技术和发展方向，明白了现在计算机领域究竟在研究什么样的问题，以及问题背后的驱动力量。 Solution并不重要，motivation才是重中之重。 Best Paper很庆幸，在会议之前我们便集体研究过上午paper的主题，这样我们基本能够更随着主讲者的思路。我个人对于会议提到Mallacc和RedSpy比较感兴趣，会议后还关注了RedSpy的开源项目。虽然对于内部的实现方式仅仅一知半解，但是他们所解决的大问题，也是我在学习过程中曾经有过的一些小想法。所以，灵感就在转瞬间，如何抓住，如何踏踏实实的研究下去，也是我以后要思考和为之奋斗的问题。 Lunch Time实话实说，这次我的注意力完全没有放在午餐上面。除了保持坐姿和吃相以外，所有的精力都放在了如何同周围的学术大牛交流上面。 坐在对面的是一位芝加哥大学的留学博士生，无奈我口语硬伤，使用纯英文沟通还是有很多词不达意的情况，最后干脆中英混杂聊了起来。虽然因为语言问题略显尴尬，但还是了解到了相当多的关于留学深造以及国外科研的情况，他也很坦然的教给了我一些关于国外学校和微软亚洲研究院的申请技巧。当然我们还聊到了本科生的课程问题，他也说出了他的理解，认为没有必要追求最主流的技术，毕竟搞教学最前沿的不一定是最能够让人理解和接受，不然何不每天讲解两篇paper呢。当然，在午饭最后，我也得到了他的邮箱，希望以后能够继续交流。 当然，唯一遗憾的还是没能和斜对面的Best Paper的得主交流。确实，在如何套磁方面我还是一点不懂，口语也并不过关，失去了一些机会，这也是我之后努力的方向吧。 Summary西安的顶会之行真的收获了很多，虽然真正参会的只有半天，但是我也初次窥得了世界最顶尖最前沿的技术究竟是什么样子；初次了解了计算机究竟应该去做什么，计算机的本质问题是什么；更重要的是能和一批最顶尖的研究者做在一起，去了解他们的研究方式和思维方式。越厉害的人越是谦虚，当面前一个真正的大牛能够face to face给你交流知道，这种欣喜可想而知。 ASPLOS之行给我心里种下了一颗种子，我已经迫不及待的看到他的生根发芽结果，希望这一天并不遥远。","tags":[{"name":"随感","slug":"随感","permalink":"http://yoursite.com/tags/随感/"}]},{"title":"2016 Summary","date":"2017-01-22T14:17:00.000Z","path":"2017/01/22/2016 Summary/","text":"2016 Summary一学期竟然过的这么快，真是难以想象。暮然回首时，仿佛还能看见昔日的我。 致往日的我 “ flag 就是用来被推翻的。” 报名时的我依稀记得大一军训的时候，听到了联创这个团队。 “他是联创dalao”，“卧槽，好牛逼啊”。 显然，就像经典的电影桥段，当我终于计划好要报名的时候，发现早就过了截止日期。 一转眼到了大二，在年级群里再一次听到了联创这个名字，仿佛冥冥的召唤，我不假思索的报了名。 显然，就像经典的电影桥段，这一次没有错过。 测试时的我其实我是很期待熬测的，一开始只是觉得好玩。毕竟之前写过一些iOS的App，也是挺想试下自己的能力。 于是，不知哪里来的蜜汁自信，熬测是周五的晚上，我周四的早晨第一次打开了OC基础教程这本书，然后高高兴兴的去赴死。 神奇的是，熬测的OC并没有太难为我，居然收到了最后的面试通知。 最后，还侥幸过了面试。 实习期的我一开始真是没有想到，联创还有如此漫长的实习期。 第一次任务时的我一脸懵逼。 这都是些什么！！！ 苍天，我要GG了。 OC基础薄弱，从来没有用纯代码写过项目，各种UI全然不熟悉。直到我看到了一本好书《Copying and pasting from stack overflow》,瞬间打开了新世界的大门。 然后这里贴贴那里补补终于搞定了任务。 第二次任务时的我一脸懵逼。 这都是些什么！！！ 苍天，我要GG了。 还记得当时直接理解错了任务，没有用Cell实现，于是，用一天的时间《重构——删除所有代码》，苦于没有美工，自己一点点的贴图，一点点的调整（不得不吐槽，纯代码写UI实在是太狗血了）， 经过了第130次微调，终于有了下面的丑态。 第三次任务时的我一脸懵逼。 这都是些什么！！！ 苍天，我要GG了。 写一个聊天机器人！！我对于网络的知识几乎为0，完全不知道从哪里下手。好在，有了一个月的时间，一个月的时间啊！ “慢慢磨，总是可以磨出来的吧”，我想。 显然，就像经典的电影桥段，我被打脸了。 对于聊天信息的显示，就耗费了我相当多的时间，头像 气泡 对话信息。。。一坨一坨的东西，完全没法驾驭。难以想象，当我实现一个黑白信息条的时候，有多么的兴奋。 “搞定了对话气泡，之后的应该好写了吧”，我想。 显然，就像经典的电影桥段，我再次被打脸了。 网络的连接，又是一个大坑。POST请求，第一次崩溃，第二次崩溃。。。连Xcode编译器都被我搞了n次崩溃。。。 当控制台终于输出了正确的message时，感觉自己掌握了世界大门的钥匙。 “搞定了网络，之后的应该好写了吧”，我想。 显然，就像经典的电影桥段，我又一次被打脸。 数据库的储存，也是个棘手的问题。当我自己都能背下来存储的数据时，手机就是显示为nil。一次nil，两次nil。。。无尽的空虚。最后才实现了数据的存储功能。 ”搞定了数据，之后的应该好写了吧“，我想。 显然，你知道我要说什么了。 调节UI简直有毒。“一个像素，再移动一个像素吧。”每次都这么说。 最后的最后，呈现了这种效果。 HackDay的我一脸懵逼。 这都是些什么！！！ 苍天，我要GG了。 其实，一开始我并不是特别想参与，感觉寒假有时间能自我充(f\u0001a\u0001ng)实(song)，然后发烧+重感冒，感觉身体被掏空。当我接触到项目的时候，发现我一开始的想法，是对的。PM要求的东西，之前的任务里面根本没有接触过，《iOS开发——从入门到绝望》。 但是，随着一点点的交流沟通，发现组队写一个项目是一件很美好的事情。尤其是有PM和两个Lab组的dalao，自己上传照片的请求被接受，觉得特别有成就感。也感受到了Deadline的刺激，直到最后的一秒钟，才输出了正确的匹配结果。 附上丑图。 致改变的我 “不努力一把，都不知道自己有多菜。” 一个学期，点点滴滴，我终于从一个什么都不懂的小白，变成了一个懂一点东西的小白。 细细想来，自己真的提升了很多。不仅仅是打字的速度，Google的能力，甚至也不仅仅是debug的能力，coding的能力，项目架构的能力。而是对于未知问题的探索能力，每一次的task，都是一次对自己的挑战，“如何利用Deadline提高生产力“，这才是真正的提升。 在和dalao交流的时候，发现了自己特别多的不足。我又想起了马克思主义基本原理的否定之否定规律。每周一次的Meet Up，都是一次对自我的否定，也是我前进发展的动力。从发现自己不会debug，到发现自己不会写代码，之后发现自己不懂计算机，最后怀疑自己是不是只会开机关机。每一次都是绝望再绝望的过程。 致现在的我 “明天的我会不会比今天更强？” 感谢周围的dalao，感谢UniqueStudio这个团队，感谢自己当初的决定和之后的自我否定，感谢自己没有虚度又一个学期。 回忆了过去这么多我，开始对下一年的我，下一月的我，下一周的我，下一刻的我，又有了些期待。 明天的我会不一样吗？ 当然，因为那就是我。","tags":[{"name":"随感","slug":"随感","permalink":"http://yoursite.com/tags/随感/"},{"name":"联创","slug":"联创","permalink":"http://yoursite.com/tags/联创/"}]},{"title":"小小Q","date":"2017-01-20T00:22:00.000Z","path":"2017/01/20/Wetalk/","text":"小小Q基于Objective-C纯代码的实时聊天应用，使用图灵机器人API接口并支持图片搜索等多种模式的对话沟通。支持本地推送 3D-Touch等等功能。 简介我的第一个成型的APP，开发的第一步。 图片预览","tags":[]},{"title":"Hello World","date":"2017-01-19T13:27:47.000Z","path":"2017/01/19/Hello World/","text":"Hello World Stay Single, Stay Simple 12345#include&lt;stdio.h&gt;int main (int argc, char *argv[])&#123; printf(\"Hello, World!\\n\");&#125; 极客到极致 欢迎访问我的Github","tags":[{"name":"随感","slug":"随感","permalink":"http://yoursite.com/tags/随感/"}]}]